# Курсовая работа № 2
## Аналитика. Начальный уровень

## Часть первая


Перед вами стоит задача – подготовить аналитический отчет для HR-отдела. На основании проведенной аналитики предполагается составить рекомендации для отдела кадров по стратегии набора персонала, а также по взаимодействию с уже имеющимися сотрудниками.
<br><br> В базе данных лежит набор таблиц, которые содержат данные о сотрудниках вымышленной компании.
Сделайте обзор штата сотрудников компании. Составьте набор предметов исследования, а затем проверьте их на данных. Вся аналитика должна быть выполена с помощью SQL. Впоследствии данные можно визуализировать, однако финальные датафреймы для графиков также должны быть подготовлены с помощью SQL. <br><br>

Примеры гипотез:
1. Есть зависимость между `perfomance score` и тем, под чьим руководством работает сотрудник.
2. Есть зависимость между продолжительностью работы в компании и семейным положением сотрудника.
2. Есть зависимость между продолжительностью работы в компании и возрастом сотрудника.

<br><br>
Параметры для подключения следующие: хост – `dsstudents.skillbox.ru`, порт – `5432`, имя базы данных – `human_resources`, пользователь – `readonly`, пароль – `6hajV34RTQfmxhS`. Таблицы, доступные для анализа, – `hr_dataset`, `production_staff`, `recruiting_costs`, `salary_grid`.

In [2]:
! pip install psycopg2

Collecting psycopg2
  Downloading psycopg2-2.8.6-cp38-cp38-win_amd64.whl (1.1 MB)
Installing collected packages: psycopg2
Successfully installed psycopg2-2.8.6

In [1]:
import pandas as pd
import sqlalchemy
import psycopg2

In [2]:
conn = 'postgresql+psycopg2://readonly:6hajV34RTQfmxhS@dsstudents.skillbox.ru:5432/human_resources'

engine = sqlalchemy.create_engine(conn)
connect = engine.connect()

inspector = sqlalchemy.inspect(engine)
inspector.get_table_names()

['hr_dataset_new',
 'hr_dataset',
 'production_staff_new',
 'recruiting_costs_new',
 'salary_grid_new',
 'production_staff',
 'amount_emps_new',
 'recruiting_costs',
 'salary_grid',
 'amount_emps']

In [3]:
hr_dataset = pd.read_sql('select * from hr_dataset_new', connect, index_col='index')
hr_dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 310 entries, 0 to 309
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   id                   310 non-null    int64
 1   employee_name        310 non-null    object
 2   employee_number      310 non-null    int64
 3   marriedid            310 non-null    int64
 4   maritalstatusid      310 non-null    int64
 5   genderid             310 non-null    int64
 6   empstatus_id         310 non-null    int64
 7   deptid               310 non-null    int64
 8   perf_scoreid         310 non-null    int64
 9   age                  310 non-null    int64
 10  pay_rate             310 non-null    float64
 11  state                310 non-null    object
 12  zip                  310 non-null    int64
 13  dob                  310 non-null    object
 14  sex                  310 non-null    object
 15  maritaldesc          310 non-null    object
 16  citizendesc          310 non-null    object
 17  hispanic_latino      310 non-null    object
 18  racedesc             310 non-null    object
 19  date_of_hire         310 non-null    object
 20  days_employed        310 non-null    int64
 21  date_of_termination  103 non-null    object
 22  reason_for_term      310 non-null    object
 23  employment_status    310 non-null    object
 24  department           310 non-null    object
 25  position             310 non-null    object
 26  manager_name         310 non-null    object
 27  employee_source      310 non-null    object
 28  performance_score    310 non-null    object
dtypes: float64(1), int64(11), object(17)
memory usage: 72.7+ KB

In [4]:
status = pd.read_sql('select employment_status, count(employment_status) from hr_dataset_new\
                             group by employment_status',connect)
print('Количество сотрудников по статусу в компании позволяет оценивать численность сотрудников')
status

Количество сотрудников по статусу в компании позволяет оценивать численность сотрудников

        employment_status  count
0            Future Start     11
1  Voluntarily Terminated     88
2                  Active    183
3    Terminated for Cause     14
4        Leave of Absence     14

In [5]:
staff_turnover = pd.read_sql("select (((select count(employment_status) from hr_dataset_new\
                             where employment_status in ('Voluntarily Terminated'))\
                             +(select count(employment_status) from hr_dataset_new\
                             where employment_status in ('Terminated for Cause')))*100/(count(employment_status)))\
                             as turnover from hr_dataset_new",connect)
print('Текучесть кадров,(%) показывает процент ухода сотрудников из компании. Стоит выяснить причины')
staff_turnover

Текучесть кадров,(%) показывает процент ухода сотрудников из компании. Стоит выяснить причины

   turnover
0        32

In [6]:
mng_scr = pd.read_sql('select manager_name, performance_score, count(employee_name) from hr_dataset_new \
                      group by manager_name, performance_score order by manager_name',connect)
print('Количество работников с разными оценками у каждого менеджера позволяет увидеть эффективность каждого менеджера.')
mng_scr

Количество работников с разными оценками у каждого менеджера позволяет увидеть эффективность каждого менеджера.

       manager_name         performance_score  count
0   Alex Sweetwater              90-day meets      2
1   Alex Sweetwater               Fully Meets      4
2   Alex Sweetwater               Exceptional      1
3   Alex Sweetwater         Needs Improvement      1
4   Alex Sweetwater                   Exceeds      1
..              ...                       ...    ...
81   Webster Butler              90-day meets      3
82   Webster Butler                   Exceeds      2
83   Webster Butler         Needs Improvement      2
84   Webster Butler               Fully Meets     11
85   Webster Butler  N/A- too early to review      3

[86 rows x 3 columns]

In [7]:
avg_age_dep = pd.read_sql('select department, avg(age) from hr_dataset_new group by department',connect)
print('Средний возраст сотрудников по департаменатм позволяет выбирать разные подходы для работы с пресоналом.\n\
Оценить возможномсть притока более молодых специалистов с новыми идеями')
avg_age_dep

Средний возраст сотрудников по департаменатм позволяет выбирать разные подходы для работы с пресоналом.
Оценить возможномсть притока более молодых специалистов с новыми идеями

             department        avg
0     Production         39.379808
1         Admin Offices  32.300000
2                 IT/IS  38.020000
3      Executive Office  63.000000
4  Software Engineering  35.900000
5                 Sales  39.096774

In [8]:
gender = pd.read_sql('select sex, count(sex) from hr_dataset_new group by sex',connect)
print('Количесвто мужчин женщин превышает количество мужчин, это может вылиться в дополнительные расходы на больничные\n\
декретные')
gender

Количесвто мужчин женщин превышает количество мужчин, это может вылиться в дополнительные расходы на больничные
декретные

      sex  count
0  Female    177
1    Male    133

In [9]:
#средняя зп по отделам
avg_salary = pd.read_sql('select hr_dataset_new.department, hr_dataset_new.position,sum(salary_grid_new.salary_mid)\
                         from hr_dataset_new join salary_grid_new on salary_grid_new.position=hr_dataset_new.position\
                         group by hr_dataset_new.department, hr_dataset_new.position', connect)
print('Фонд зароботной платы по департаментам позволяет увидеть расходы на выплату зароботной платы в каждом департаменте')
avg_salary

Фонд зароботной платы по департаментам позволяет увидеть расходы на выплату зароботной платы в каждом департаменте

          department                  position        sum
0              IT/IS    Database Administrator   887978.0
1              IT/IS      Sr. Network Engineer   497290.0
2      Admin Offices            Sr. Accountant   153976.0
3      Admin Offices              Accountant I   154275.0
4              IT/IS                   Sr. DBA   464028.0
5  Production          Production Technician I  5440000.0
6      Admin Offices  Administrative Assistant   120000.0
7              IT/IS          Network Engineer   601650.0
8  Production         Production Technician II  2736000.0

In [10]:
print('Количество привлеченных сотрудников из разных источников показывет эффективность привлечения новых сотрудников.\n\
Возможно стоит отказаться от некоторых источников и тем самым сократить расходы на рекрутинг')
pd.read_sql('select employee_source, count(employee_name) from hr_dataset_new group by employee_source\
                            order by employee_source' ,connect)

Количество привлеченных сотрудников из разных источников показывет эффективность привлечения новых сотрудников.
Возможно стоит отказаться от некоторых источников и тем самым сократить расходы на рекрутинг

                           employee_source  count
0                                Billboard     16
1                            Careerbuilder      1
2               Company Intranet - Partner      1
3                       Diversity Job Fair     29
4                        Employee Referral     31
5                                Glassdoor     14
6                                   Indeed      8
7                      Information Session      4
8                          Internet Search      6
9                                 MBTA ads     17
10                             Monster.com     24
11                      Newspager/Magazine     18
12                    On-campus Recruiting     12
13                 On-line Web application      1
14                                   Other      9
15                           Pay Per Click      1
16                  Pay Per Click - Google     21
17                    Professional Society     20
18       Search Engine - Google Bing Yahoo     25
19  Social Networks - Facebook Twitter etc     11
20                         Vendor Referral     15
21                      Website Banner Ads     13
22                           Word of Mouth     13

In [11]:
print('Средний стаж работы в компании по департаментам. С одоной стороны опыт и болшой стаж - это хорошо.\n\
Но с другой отсутсиве новых идей может привести с застою. Видно, что самы малый стаж в отделе IT.')
pd.read_sql('select department, avg(days_employed) from hr_dataset_new group by department',connect)

Средний стаж работы в компании по департаментам. С одоной стороны опыт и болшой стаж - это хорошо.
Но с другой отсутсиве новых идей может привести с застою. Видно, что самы малый стаж в отделе IT.

             department          avg
0     Production         1308.024038
1         Admin Offices  1420.700000
2                 IT/IS   981.800000
3      Executive Office  1973.000000
4  Software Engineering  1417.800000
5                 Sales  1621.548387

In [12]:
production_staff = pd.read_sql('select * from production_staff_new',connect, index_col='index')
production_staff

,id,employee_name,race_desc,date_of_hire,termdate,reason_for_term,employment_status,department,position,pay,manager_name,performance_score,abutments_hour_wk_1,abutments_hour_wk_2,daily_error_rate,90_day_complaints
index,,,,,,,,,,,,,,,,
0,1,"Albert, Michael",White,2011-08-01,None,N/A - still employed,Active,Production,Production Manager,$54.50,Elisa Bramante,Fully Meets,0.0,0.0,0.0,0.0
1,2,"Bozzi, Charles",Asian,2013-09-30,2014-08-07,retiring,Voluntarily Terminated,Production,Production Manager,$50.50,Elisa Bramante,Fully Meets,0.0,0.0,0.0,0.0
2,3,"Butler, Webster L",White,2016-01-28,None,N/A - still employed,Active,Production,Production Manager,$55.00,Elisa Bramante,Exceeds,0.0,0.0,0.0,0.0
3,4,"Dunn, Amy",White,2014-09-18,None,N/A - still employed,Active,Production,Production Manager,$51.00,Elisa Bramante,Fully Meets,0.0,0.0,0.0,0.0
4,5,"Gray, Elijiah",White,2015-06-02,None,N/A - still employed,Active,Production,Production Manager,$54.00,Elisa Bramante,Fully Meets,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
251,252,None,None,None,None,None,None,None,None,None,None,None,NaN,NaN,NaN,NaN
252,253,None,None,None,None,None,None,None,None,None,None,None,NaN,NaN,NaN,NaN
253,254,None,None,None,None,None,None,None,None,None,None,None,NaN,NaN,NaN,NaN
254,255,None,None,None,None,None,None,None,None,None,None,None,NaN,NaN,NaN,NaN
255,256,None,None,None,None,None,None,None,None,None,None,None,NaN,NaN,NaN,NaN

In [13]:
pd.read_sql('select race_desc, count(race_desc) from production_staff_new group by race_desc',connect)

                          race_desc  count
0                              None      0
1                          Hispanic      3
2                             Asian     22
3                             White    140
4         Black or African American     31
5  American Indian or Alaska Native      3
6                 Two or more races     10

In [14]:
recruiting_costs = pd.read_sql('select * from recruiting_costs_new',connect, index_col='index')
recruiting_costs.head()

,id,employment_source,january_,february,march,april,may,june,july,august,september,october,november,december,total
index,,,,,,,,,,,,,,,
0,1,Billboard,520,520,520,520,0,0,612,612,729,749,910,500,6192
1,2,Careerbuilder,410,410,410,820,820,410,410,820,820,1230,820,410,7790
2,3,Company Intranet - Partner,0,0,0,0,0,0,0,0,0,0,0,0,0
3,4,Diversity Job Fair,0,5129,0,0,0,0,0,4892,0,0,0,0,10021
4,5,Employee Referral,0,0,0,0,0,0,0,0,0,0,0,0,0

In [15]:
df_4 = pd.read_sql('select * from salary_grid',connect)
df_4

,id,Position,Salary Min,Salary Mid,Salary Max,Hourly Min,Hourly Mid,Hourly Max
0,1,Administrative Assistant,30000,40000,50000,14.42,19.23,24.04
1,2,Sr. Administrative Assistant,35000,45000,55000,16.83,21.63,26.44
2,3,Accountant I,42274,51425,62299,20.32,24.72,29.95
3,4,Accountant II,50490,62158,74658,24.27,29.88,35.89
4,5,Sr. Accountant,63264,76988,92454,30.42,37.01,44.45
5,6,Network Engineer,50845,66850,88279,24.44,32.14,42.44
6,7,Sr. Network Engineer,79428,99458,120451,38.19,47.82,57.91
7,8,Database Administrator,50569,68306,93312,24.31,32.84,44.86
8,9,Sr. DBA,92863,116007,139170,44.65,55.77,66.91
9,10,Production Technician I,30000,40000,50000,14.42,19.23,24.04
10,11,Production Technician II,38000,48000,58000,18.27,23.08,27.88
11,12,Lead Production Technician,45000,55000,65000,21.63,26.44,31.25